Autodesk.Revit.DB.LinePatternSegmentType
Represents the type of a line pattern segment.

Autodesk.Revit.DB.LinePatternSegmentType.Dot
A dot

Autodesk.Revit.DB.LinePatternSegmentType.Space
A space

Autodesk.Revit.DB.LinePatternSegmentType.Dash
A dash